runs/snake3d/front_lip/1k30/RANS/system/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// This application/dictionary controls:
// - optional: create new patches from boundary faces (either given as
//   a set of patches or as a faceSet)
// - always: order faces on coupled patches such that they are opposite. This
//   is done for all coupled faces, not just for any patches created.
// - optional: synchronise points on coupled patches.

// 1. Create cyclic:
// - specify where the faces should come from
// - specify the type of cyclic. If a rotational specify the rotationAxis
//   and centre to make matching easier
// - always create both halves in one invocation with correct 'neighbourPatch'
//   setting.
// - optionally pointSync true to guarantee points to line up.

// 2. Correct incorrect cyclic:
// This will usually fail upon loading:
//  "face 0 area does not match neighbour 2 by 0.0100005%"
//  " -- possible face ordering problem."
// - in polyMesh/boundary file:
//      - loosen matchTolerance of all cyclics to get case to load
//      - or change patch type from 'cyclic' to 'patch'
//        and regenerate cyclic as above


// Do a synchronisation of coupled points after creation of any patches.
// Note: this does not work with points that are on multiple coupled patches
//       with transformations (i.e. cyclics).
pointSync false;

// Patches to create.
patches (
{
  // Name of new patch
  name snake;
  // Type of new patch
  patchInfo
  {
    type wall;
    physicalType wall;
  }
  // How to construct: either from 'patches' or 'set'
  constructFrom patches;
  // If constructFrom = patches : names of patches. Wildcards allowed.
  patches (snake);
}
{
  name top;
  patchInfo
  {
    type symmetryPlane;
    physicalType patch;
  }
  constructFrom patches;
  patches (top);
}
{
  name bottom;
  patchInfo
  {
    type symmetryPlane;
    physicalType patch;
  }
  constructFrom patches;
  patches (bottom);
}
{
  name inlet;
  patchInfo
  {
    type patch;
    physicalType inlet;
  }
  constructFrom patches;
  patches (inlet);
}
{
  name outlet;
  patchInfo
  {
    type patch;
    physicalType outlet;
  }
  constructFrom patches;
  patches (outlet);
}
{
  name front;
  patchInfo
  {
    type cyclic;
    neighbourPatch back;
    physicalType patch;
  }
  constructFrom patches;
  patches (back);
}
{
  name back;
  patchInfo
  {
    type cyclic;
    neighbourPatch front;
    physicalType patch;
  }
  constructFrom patches;
  patches (front);
}
);

//****************************************************************************//
