runs/snake3d/front_lip/1k30/RANS/0_org/omega
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions [0 0 -1 0 0 0 0];

internalField uniform 1312.8;

boundaryField
{
    snake
    {
        type omegaWallFunction;
        value $internalField;
    }

    inlet
    {
        type fixedValue;
        value $internalField;
    }

    outlet
    {
        type zeroGradient;
    }

    bottom
    {
        type symmetryPlane;
    }

    top
    {
        type symmetryPlane;
    }

    front
    {
        type cyclic;
    }

    back
    {
        type cyclic;
    }
}

//****************************************************************************//
